package com.example.aboutesports.Repo.dataTest

import com.example.aboutesports.Repo.dataBin.News
import com.google.firebase.auth.FirebaseUser

object NewsTest {
    var lstTest1 = listOf(
        News(
            1,
            "Обновление Dota 2 от 18 ноября: Spirit Breaker вернули прежнее название",
            """В ночь на 18 ноября разработчики выпустили обновление для клиента Dota 2.
    Список изменений составлен на GitHub.Spirit Breaker Team Spirit Breaker переименован обратно в Spirit Breaker Spirit Breaker (пока только в англоязычном клиенте).
    Локализация Внесены изменения в файл локализации способностей для русского языка; Обновлен перевод на множество языков.
""",
            imageUrl = "https://firebasestorage.googleapis.com/v0/b/about-esports.appspot.com/o/spooky-ghosts-in-dark-forest-at-night_107791-13548.jpg?alt=media&token=1ff91d79-01b5-47d2-8667-e1d573e8339b",
            time = 254
        ), News(2,
            "Обновление Dota 2 от 18 ноября: Spirit Breaker вернули прежнее название",
            """В ночь на 18 ноября разработчики выпустили обновление для клиента Dota 2. Список изменений составлен на GitHub.
    Список изменений
    Герои
    Spirit Breaker Team Spirit Breaker переименован обратно в Spirit Breaker Spirit Breaker (пока только в англоязычном клиенте).
    Локализация
    Внесены изменения в файл локализации способностей для русского языка; Обновлен перевод на множество языков.
    Размер обновления: 30,9 МБ.
    Версия клиента: 5929.""" ,
            "https://dota2.ru/img/uploads/18/10/1051827.jpg",
            254
        ),

                News(3,
        "Стали известны все участники турнира 25 Year Anniversary Show",
        """Обнародована вторая половина участников 25 Year Anniversary Show. О приглашении NAVI Junior, Alliance, Klim Sani4 и других организаторы написали в Twitter.
    Вторая десятка участников 25 Year Anniversary Show:
    Швеция Alliance;
    СНГ Team Klee;
    Беларусь Atlas Burden;
    Перу BOOM Esports;
    Европа D2 Hustlers;
    Россия Klim Sani4;
    Европа MB Team;
    СНГ MoneyMakers;
    Украина NAVI Junior;
    Бразилия Keyd Stars.
    Ранее организаторы объявили о приглашении Украина Natus Vincere, Европа Team Tickles, Европа Level UP, Украина B8, Греция KZ Team, Россия Nemiga Gaming, Россия One Move, Россия SIBE Team, Европа Team Falcons и Россия Virtus.pro.
    25 Year Anniversary Show пройдет с 20 ноября по 6 декабря в онлайн-формате. Двадцать команд разыграют призовой фонд в размере $100 000.""" ,
        "https://dota2.ru/img/uploads/23/11/1071679.webp",
        254
    ),

    News(4,
    "Панды неплохо нашли себя в стиле с 2мя керри — Maelstorm о 9Pandas на квалификации ESL One Kuala Lumpur 2023",
    """Комментатор Владимир 'Maelstorm' Кузьминов подвел итоги игрового дня закрытых квалификации на ESL One Kuala Lumpur 2023 для разных регионов. Аналитикой он поделился в личном telegram-канале.
    Юго-Восточная Азия
    Невозможно не отметить поражение и вылет Таиланд Aurora, являвшихся явными фаворитами.
    Восточная Европа
    BB подтвердили свой статус, что касается остальных, то катки будут очень упорными. Панды неплохо нашли себя в стиле с 2мя керри, VP мучаются с заменами, но в целом играют неплохо, могли даже BB подвинуть.
    Клим Саныч... мне кажется, что за них будут завтра топить все. Отлично выбрали название, реально мощно заехали, шансы пройти есть!
    Западная Европа
    Liquid просто порвали всех. Думаю, что вторая квота будет за СНГ Entity, хотя с Европа OG им было сложно, но и Secret, как мы знаем, команда коварная.
    Ближний Восток и Северная Африка
    Чуть не забыл PSG.Quest всё же одолели Falcons 2-1, но завтра их ждёт реванш.
    Сегодня, 18 ноября, пройдут финальные дни отборочных ESL One Kuala Lumpur 2023 в каждом из регионов. По их итогу определятся последние семь участников LAN-турнира в Малайзии.""" ,
    "https://dota2.ru/img/news/slider/t1687685122.webp",
    254
    ),

    News(5,
    "Team Liquid прошла на ESL One Kuala Lumpur 2023",
    """Первым победителем ESL One Kuala Lumpur 2023: Закрытые квалификации Западной Европы стала Team Liquid. Команда отобралась на LAN в Малайзии по верхней сетке.
    Team Liquid 2:0 Entity
    Team Liquid не встретила сопротивления на отборочных. За три серии в верхней сетке команда не отдала противникам ни одной карты. Во второй день квалификации она всухую обыграла сначала Европа Team Tickles, а затем СНГ Entity.
    Из-за отказа Россия Team Spirit от участия в ESL One Kuala Lumpur 2023 Западная Европа получила два слота на квалификации. Второй в нижней сетке разыграют СНГ Entity и победитель пары Европа OG против Европа Team Secret.""" ,
    "https://dota2.ru/img/esport/team/45.webp?1678285470",
    254
    ),

    News(6,
    "OG победила в соревновании по решаффлу — MiLAN про ari",
    """Саппорт Level UP Милан 'MiLAN' Козомара назвал Мэттью 'ari' Уолкера лучшим игроком четвертой позиции на данный момент. Мнением о киберспортсмене он поделился в Twitter.
    Милан 'MiLAN' Козомара
    Великобритания ari — буквально лучший игрок четвертой позиции в мире прямо сейчас. Вне зависимости от результата на закрытой квалификации Европа OG победила в соревновании по решаффлу.
    В прошлом сезоне Великобритания ari выступал за Мир TSM. С командой он вошел в топ-12 на The International 2023. До старта карьеры в Dota 2 игрок профессионально играл в Heroes of the Storm.""" ,
    "https://dota2.ru/img/persons/257.png?1608304350",
    254
    ),

    News(7,
    "BetBoom Team прошла на ESL One Kuala Lumpur 2023",
    """Определился первый победитель ESL One Kuala Lumpur 2023: Закрытые квалификации Восточной Европы. В финале верхней сетки сильнее оказалась BetBoom Team.
    BetBoom Team 2:1 Virtus.pro
    И BetBoom Team, и Virtus.pro было непросто пройти в финал. Первая отдала карту Украина Natus Vincere, а вторая — Россия Klim Sani4. «Медведи» снова играли без Россия Kiritych, на этот раз его заменял Беларусь Smiling Knight.
    Virtus.pro первой повела в серии, но следующие две карты хоть и проходоли по похожему сценарию — сначала Россия BetBoom Team захватывала ранее преимущество, но затягивала с завершением и переводила игру в лейт — остались за соперником.
    За второй слот на The Kuala Lumpur Major от региона Россия Virtus.pro поборется с победителем пары Россия Klim Sani4 против Россия 9Pandas.""" ,
    "https://dota2.ru/img/esport/team/5801.webp?1678643833",
    254
    ),

    News(8,
    "3,3 тыс. человек получат коллекционный Aegis of Champions с TI12 — это на 53 тыс. меньше, чем было на TI11",
    """За достижение 300-го уровня компендиума 3 355 человек получат физическую копию Aegis of Champions. Данные опубликовал аналитический сервис STRATZ.
    3 355 игрокам отправят миниатюрные Эгиды с The International 2023 за достижения 300-го уровня компендиума — это является худшим показателем за всю историю турниров серии The International.
    В прошлом году 56 381 человек стали обладателями коллекционного Aegis of the Champions, а рекордсменом по этому показателю является The International 2018 — тогда мини-Аегисы получили сразу 162 223 игрока.
    The International 2023 проходил с 12 по 30 октября в Сиэтле на площадке Climate Pledge Arena. 20 коллективов со всего мира сражались за призовой фонд в размере $3 327 768 и Эгиду Чемпионов. Победителем соревнования стала Россия Team Spirit.""" ,
    "https://dota2.ru/img/uploads/23/11/1071678.webp",
    254
    ),

    News(9,
    "Сборная России стала чемпионом Открытых киберспортивных студенческих игр билайна 2023",
    """Сборная России победила сборную Беларуси в финале Открытых киберспортивных студенческих игр билайна 2023 по CS:GO. Встреча завершилась со счетом 2:0 — 16:7 на Anubis и 16:2 на Ancient.
    На групповом этапе оба финалиста заняли первые места. В полуфиналах плей-офф сборная России обыграла сборную Казахстана, а сборная Беларуси победила сборную Кыргызстана.
    Финальный этап Открытых киберспортивных студенческих игр билайна 2023 по CS:GO прошел на LAN 28–29 октября. Призовой фонд соревнования составил ₽2,5 млн.""",
    "",
    254
    ),

    News(10,
    "S1mple признан лучшим игроком в истории CS:GO по версии портала HLTV.org",
    """Портал HLTV.org присудил звание самого лучшего игрока в истории CS:GO снайперу Natus Vincere Александру s1mple Костылеву. Журналисты признали его сильнейшим, основываясь на нескольких статистических показателях.
    Авторы материала отметили, что s1mple также завоевал наибольшее количество наград самого ценного игрока на турнирах и получил два главных трофея — победу на мейджоре и приз Intel Grand Slam.
    Основными конкурентами Костылева за звание лучшего игрока в истории CS:GO были Матье ZywOo Эрбо и Николай device Ридтц, однако первый начал выступать на топовом уровне значительно позже украинца, а второй не дотянут по статистическим показателям.
    Ранее команды сыграли последний турнир по CS:GO — им стал BLAST Premier: Fall Showdown 2023. Все следующие ивенты будут проводиться на новой версии шутера — Counter-Strike 2.""",
    "https://virtus-img.cdnvideo.ru/images/as-is/plain/04/0436b468-ca67-4c7b-ad73-a7020ae26afa.jpg",
    254
    )

    )
    var user: FirebaseUser? = null
    var userEmail: String? = null
}
